app/views/tasks/edit.html.erb

    <%= form.label :categories %>
    <%= form.collection_check_boxes :category_ids, Category.all, :id, :name %>
---
SELECT "categories".* FROM "categories"