app/views/tasks/index.html.erb

          <td><%= link_to task.title, task_path(task), class: "task-title" %></td>
          <td><%= link_to @users.find(task.user_id).username, user_path(task.user_id), class: "username-link" %></td>
          <td><%= task.status %></td>
          <% if task.categories.count > 0 %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "categories" INNER JOIN "categories_tasks" ON "categories"."id" = "categories_tasks"."category_id" WHERE "categories_tasks"."task_id" = 1