app/views/tasks/index.html.erb

SELECT "categories".* FROM "categories"
---
        <label for="category_id">Категория:</label>
        <%= select_tag :category_id, options_from_collection_for_select(Category.all, :id, :name, params[:category_id]), include_blank: true %>

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "categories".* FROM "categories" INNER JOIN "categories_tasks" ON "categories"."id" = "categories_tasks"."category_id" WHERE "categories_tasks"."task_id" = 4
SELECT 1 AS one FROM "categories" INNER JOIN "categories_tasks" ON "categories"."id" = "categories_tasks"."category_id" WHERE "categories_tasks"."task_id" = 5 LIMIT 1
SELECT "users".* FROM "users"
---
          <td><%= link_to task.title, task_path(task), class: "task-title" %></td>
          <td><%= link_to @users.find(task.user_id).username, user_path(task.user_id), class: "username-link" %></td>
          <td><%= task.status.present? ? task.status : '-' %></td>
          <td><%= task.categories.any? ? task.categories.map(&:name).join(", ") : '-' %></td>
          <td><%= task.assigned_user.present? ? link_to(task.assigned_user.username, user_path(task.assigned_user.id), class: "username-link") : '-' %></td>