app/views/tasks/new.html.erb

      <%= form.label :assigned_user_id, "Assigned User", class: "field-label" %>
      <%= form.select :assigned_user_id, [['Не назначен', nil]] + @users.map { |user| [user.username, user.id] }, { prompt: false }, { class: "field-input" } %>
---
SELECT "users".* FROM "users"

      <%= form.label :categories, class: "field-label" %>
      <% if Category.any? %>
        <%= form.collection_check_boxes :category_ids, Category.all, :id, :name do |b| %>
---
SELECT "categories".* FROM "categories"
SELECT 1 AS one FROM "categories" LIMIT 1