app/views/tasks/show.html.erb

    <strong>Категории:</strong>
    <%= @task.categories.pluck(:name).join(', ') %>
---
SELECT "categories"."name" FROM "categories" INNER JOIN "categories_tasks" ON "categories"."id" = "categories_tasks"."category_id" WHERE "categories_tasks"."task_id" = 3