app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ('Main', '2024-12-12 12:44:33.161149', '2024-12-12 12:44:33.161149') RETURNING "id"