app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 1 AND "tasks"."id" = 1 LIMIT 1
---
  def show
    @task = @current_user.tasks.find(params[:id])

INSERT INTO "tasks" ("title", "description", "user_id", "status", "created_at", "updated_at") VALUES ('123', '123', 1, 'в процессе', '2024-12-11 18:58:07.645494', '2024-12-11 18:58:07.645494') RETURNING "id"
---
  def create
    @task = @current_user.tasks.build(task_params)
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 1 AND "tasks"."id" = 1 LIMIT 1
---
  def edit
    @task = @current_user.tasks.find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 1 AND "tasks"."id" = 1 LIMIT 1
UPDATE "tasks" SET "title" = '12334', "description" = '12334', "status" = 'завершено', "updated_at" = '2024-12-11 18:58:17.845208' WHERE "tasks"."id" = 1
---
  def update
    @task = @current_user.tasks.find(params[:id])
    if @task.update(task_params)