app/controllers/tasks_controller.rb

SELECT "users".* FROM "users"
SELECT "tasks".* FROM "tasks"
SELECT "categories".* FROM "categories" INNER JOIN "categories_tasks" ON "categories"."id" = "categories_tasks"."category_id" WHERE "categories_tasks"."task_id" = 1
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 1
SELECT COUNT(*) FROM "categories" INNER JOIN "categories_tasks" ON "categories"."id" = "categories_tasks"."category_id" WHERE "categories_tasks"."task_id" = 1
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "tasks" LIMIT 6 OFFSET 0) subquery_for_count
---
  def index
    @users = User.all
    @tasks = Task.all

    if params[:status].present?
      @tasks = @tasks.where(status: params[:status])
    end

    if params[:assigned_user_id].present?
      @tasks = @tasks.where(assigned_user_id: params[:assigned_user_id])
    end

    if params[:category_id].present?
      @tasks = @tasks.joins(:categories).where(categories: { id: params[:category_id] })
    end

    @tasks = @tasks.page(params[:page]).per(6)

SELECT "users".* FROM "users"
---
  def new
    @task = @current_user.tasks.build
    @users = User.all

INSERT INTO "tasks" ("title", "description", "user_id", "status", "created_at", "updated_at", "assigned_user_id") VALUES ('dfffgfg', 'dsc', 1, 'backlog', '2024-12-15 21:56:21.248714', '2024-12-15 21:56:21.248714', 1) RETURNING "id"
---
  def create
    @task = @current_user.tasks.build(task_params)
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 4 LIMIT 1
---
  def edit
    @task = @current_user.tasks.find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 1 AND "tasks"."id" = 1 LIMIT 1
UPDATE "tasks" SET "title" = '12334', "description" = '12334', "status" = 'завершено', "updated_at" = '2024-12-11 18:58:17.845208' WHERE "tasks"."id" = 1
---
  def update
    @task = @current_user.tasks.find(params[:id])
    if @task.update(task_params)