app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at", "avatar") VALUES ('123', '$2a$12$ACusf4aFz8yxAqcG5V9T3OJDbOv4TCQMpot.7cqOMhPPLHzPmOHJe', '2024-12-11 18:54:11.592932', '2024-12-11 18:54:11.592932', NULL) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "username" = '1233', "updated_at" = '2024-12-11 19:06:54.634812' WHERE "users"."id" = 1